Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129DNCZAD.svd
        <register>
          <name>RXINTERVAL7</name>
          <description>USB Host Receive Polling Interval Endpoint 7</description>
          <addressOffset>0x0000017D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL7_TXPOLL</name>
              <description>RX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL7</name>
          <description>USB Host Receive Polling Interval Endpoint 7</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000017D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL7_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAINTR</name>
          <description>USB DMA Interrupt</description>
          <addressOffset>0x00000200</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_DMAINTR_CH0</name>
              <description>Channel 0 DMA Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMAINTR_CH1</name>
              <description>Channel 1 DMA Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMAINTR_CH2</name>
              <description>Channel 2 DMA Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMAINTR_CH3</name>
              <description>Channel 3 DMA Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMAINTR_CH4</name>
              <description>Channel 4 DMA Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_DMAINTR_CH5</name>
              <description>Channel 5 DMA Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_DMAINTR_CH6</name>
              <description>Channel 6 DMA Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_DMAINTR_CH7</name>
              <description>Channel 7 DMA Interrupt</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL0</name>
          <description>USB DMA Control 0</description>
          <addressOffset>0x00000204</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL0_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL0_DIR</name>
              <description>DMA Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL0_MODE</name>
              <description>DMA Transfer Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL0_IE</name>
              <description>DMA Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL0_EP</name>
              <description>Endpoint number</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL0_ERR</name>
              <description>Bus Error Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL0_BRSTM</name>
              <description>Burst Mode</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL0_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL0_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL0_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL0_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR0</name>
          <description>USB DMA Address 0</description>
          <addressOffset>0x00000208</addressOffset>
          <fields>
            <field>
              <name>USB_DMAADDR0_ADDR</name>
              <description>DMA Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT0</name>
          <description>USB DMA Count 0</description>
          <addressOffset>0x0000020C</addressOffset>
          <fields>
            <field>
              <name>USB_DMACOUNT0_COUNT</name>
              <description>DMA Count</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL1</name>
          <description>USB DMA Control 1</description>
          <addressOffset>0x00000214</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL1_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL1_DIR</name>
              <description>DMA Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL1_MODE</name>
              <description>DMA Transfer Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL1_IE</name>
              <description>DMA Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL1_EP</name>
              <description>Endpoint number</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL1_ERR</name>
              <description>Bus Error Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL1_BRSTM</name>
              <description>Burst Mode</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL1_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL1_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL1_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL1_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR1</name>
          <description>USB DMA Address 1</description>
          <addressOffset>0x00000218</addressOffset>
          <fields>
            <field>
              <name>USB_DMAADDR1_ADDR</name>
              <description>DMA Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT1</name>
          <description>USB DMA Count 1</description>
          <addressOffset>0x0000021C</addressOffset>
          <fields>
            <field>
              <name>USB_DMACOUNT1_COUNT</name>
              <description>DMA Count</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL2</name>
          <description>USB DMA Control 2</description>
          <addressOffset>0x00000224</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL2_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL2_DIR</name>
              <description>DMA Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL2_MODE</name>
              <description>DMA Transfer Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL2_IE</name>
              <description>DMA Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL2_EP</name>
              <description>Endpoint number</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL2_ERR</name>
              <description>Bus Error Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL2_BRSTM</name>
              <description>Burst Mode</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL2_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL2_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL2_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL2_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR2</name>
          <description>USB DMA Address 2</description>
          <addressOffset>0x00000228</addressOffset>
          <fields>
            <field>
              <name>USB_DMAADDR2_ADDR</name>
              <description>DMA Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT2</name>
          <description>USB DMA Count 2</description>
          <addressOffset>0x0000022C</addressOffset>
          <fields>
            <field>
              <name>USB_DMACOUNT2_COUNT</name>
              <description>DMA Count</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL3</name>
          <description>USB DMA Control 3</description>
          <addressOffset>0x00000234</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL3_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL3_DIR</name>
              <description>DMA Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL3_MODE</name>
              <description>DMA Transfer Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL3_IE</name>
              <description>DMA Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL3_EP</name>
              <description>Endpoint number</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL3_ERR</name>
              <description>Bus Error Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL3_BRSTM</name>
              <description>Burst Mode</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL3_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL3_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL3_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL3_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR3</name>
          <description>USB DMA Address 3</description>
          <addressOffset>0x00000238</addressOffset>
          <fields>
            <field>
              <name>USB_DMAADDR3_ADDR</name>
              <description>DMA Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT3</name>
          <description>USB DMA Count 3</description>
          <addressOffset>0x0000023C</addressOffset>
          <fields>
            <field>
              <name>USB_DMACOUNT3_COUNT</name>
              <description>DMA Count</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL4</name>
          <description>USB DMA Control 4</description>
          <addressOffset>0x00000244</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL4_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL4_DIR</name>
              <description>DMA Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL4_MODE</name>
              <description>DMA Transfer Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL4_IE</name>
              <description>DMA Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL4_EP</name>
              <description>Endpoint number</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL4_ERR</name>
              <description>Bus Error Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL4_BRSTM</name>
              <description>Burst Mode</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL4_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL4_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL4_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL4_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR4</name>
          <description>USB DMA Address 4</description>
          <addressOffset>0x00000248</addressOffset>
          <fields>
            <field>
              <name>USB_DMAADDR4_ADDR</name>
              <description>DMA Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT4</name>
          <description>USB DMA Count 4</description>
          <addressOffset>0x0000024C</addressOffset>
          <fields>
            <field>
              <name>USB_DMACOUNT4_COUNT</name>
              <description>DMA Count</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL5</name>
          <description>USB DMA Control 5</description>
          <addressOffset>0x00000254</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_DMACTL5_ENABLE</name>
              <description>DMA Transfer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL5_DIR</name>
              <description>DMA Direction</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL5_MODE</name>
              <description>DMA Transfer Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL5_IE</name>
              <description>DMA Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL5_EP</name>
              <description>Endpoint number</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL5_ERR</name>
              <description>Bus Error Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_DMACTL5_BRSTM</name>
              <description>Burst Mode</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DMACTL5_BRSTM_ANY</name>
                  <description>Bursts of unspecified length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL5_BRSTM_INC4</name>
                  <description>INCR4 or unspecified length</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL5_BRSTM_INC8</name>
                  <description>INCR8, INCR4 or unspecified length</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DMACTL5_BRSTM_INC16</name>
                  <description>INCR16, INCR8, INCR4 or unspecified length</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR5</name>
          <description>USB DMA Address 5</description>
          <addressOffset>0x00000258</addressOffset>
          <fields>
            <field>
              <name>USB_DMAADDR5_ADDR</name>
              <description>DMA Address</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACOUNT5</name>
          <description>USB DMA Count 5</description>
          <addressOffset>0x0000025C</addressOffset>
          <fields>
            <field>
              <name>USB_DMACOUNT5_COUNT</name>
              <description>DMA Count</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
